Revit 2027 API
IFCLevelInfo.GetLocalPlacement Method
 Gets the local placement.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetLocalPlacement()
Public Function GetLocalPlacement As IFCAnyHandle
public:
IFCAnyHandle^ GetLocalPlacement()
member GetLocalPlacement : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The local placement.
See Also
Reference
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace